MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g3/thirdparty/mspm0g3/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_AGGR_ENABLE_CLR Bits */
/* MCAN_AGGR_ENABLE_CLR[ENABLE_PARITY_CLR] Bits */
#define MCAN_AGGR_ENABLE_CLR_ENABLE_PARITY_CLR_OFS (0)                             /* !< ENABLE_PARITY_CLR Offset */
#define MCAN_AGGR_ENABLE_CLR_ENABLE_PARITY_CLR_MASK ((uint32_t)0x00000001U)         /* !< Write 1 to disable parity errors.
                                                                                    Reads return the corresponding enable
                                                                                    bit's current value. */
/* MCAN_AGGR_ENABLE_CLR[ENABLE_TIMEOUT_CLR] Bits */
#define MCAN_AGGR_ENABLE_CLR_ENABLE_TIMEOUT_CLR_OFS (1)                             /* !< ENABLE_TIMEOUT_CLR Offset */
#define MCAN_AGGR_ENABLE_CLR_ENABLE_TIMEOUT_CLR_MASK ((uint32_t)0x00000002U)         /* !< Write 1 to disable timeout errors.
                                                                                    Reads return the corresponding enable
                                                                                    bit's current value. */

/* MCAN_AGGR_STATUS_SET Bits */
/* MCAN_AGGR_STATUS_SET[AGGR_PARITY_ERR] Bits */
#define MCAN_AGGR_STATUS_SET_AGGR_PARITY_ERR_OFS (0)                             /* !< AGGR_PARITY_ERR Offset */
#define MCAN_AGGR_STATUS_SET_AGGR_PARITY_ERR_MASK ((uint32_t)0x00000003U)         /* !< Aggregator Parity Error Status
                                                                                    2-bit saturating counter of the
                                                                                    number of parity errors that have
                                                                                    occurred since last cleared.   0  No
                                                                                    parity errors have occurred   1  One
                                                                                    parity error has occurred   2  Two
                                                                                    parity errors have occurred   3
                                                                                    Three parity errors have occurred   A
                                                                                    write of a non-zero value to this bit
                                                                                    field increments it by the value
                                                                                    provided. */
/* MCAN_AGGR_STATUS_SET[SVBUS_TIMEOUT] Bits */
#define MCAN_AGGR_STATUS_SET_SVBUS_TIMEOUT_OFS   (2)                             /* !< SVBUS_TIMEOUT Offset */
#define MCAN_AGGR_STATUS_SET_SVBUS_TIMEOUT_MASK  ((uint32_t)0x0000000CU)         /* !< Aggregator Serial VBUS Timeout
                                                                                    Error Status   2-bit saturating
                                                                                    counter of the number of SVBUS
                                                                                    timeout errors that have occurred
                                                                                    since last cleared.   0  No timeout
                                                                                    errors have occurred   1  One timeout
                                                                                    error has occurred   2  Two timeout
                                                                                    errors have occurred   3  Three
                                                                                    timeout errors have occurred   A
                                                                                    write of a non-zero value to this bit
                                                                                    field increments it by the value
                                                                                    provided. */

/* MCAN_AGGR_STATUS_CLR Bits */
/* MCAN_AGGR_STATUS_CLR[AGGR_PARITY_ERR] Bits */
#define MCAN_AGGR_STATUS_CLR_AGGR_PARITY_ERR_OFS (0)                             /* !< AGGR_PARITY_ERR Offset */
#define MCAN_AGGR_STATUS_CLR_AGGR_PARITY_ERR_MASK ((uint32_t)0x00000003U)         /* !< Aggregator Parity Error Status
                                                                                    2-bit saturating counter of the
                                                                                    number of parity errors that have
                                                                                    occurred since last cleared.   0  No
                                                                                    parity errors have occurred   1  One
                                                                                    parity error has occurred   2  Two
                                                                                    parity errors have occurred   3
                                                                                    Three parity errors have occurred   A
                                                                                    write of a non-zero value to this bit
                                                                                    field decrements it by the value
                                                                                    provided. */
/* MCAN_AGGR_STATUS_CLR[SVBUS_TIMEOUT] Bits */
#define MCAN_AGGR_STATUS_CLR_SVBUS_TIMEOUT_OFS   (2)                             /* !< SVBUS_TIMEOUT Offset */
#define MCAN_AGGR_STATUS_CLR_SVBUS_TIMEOUT_MASK  ((uint32_t)0x0000000CU)         /* !< Aggregator Serial VBUS Timeout
                                                                                    Error Status   2-bit saturating
                                                                                    counter of the number of SVBUS
                                                                                    timeout errors that have occurred
                                                                                    since last cleared.   0  No timeout
                                                                                    errors have occurred   1  One timeout
                                                                                    error has occurred   2  Two timeout
                                                                                    errors have occurred   3  Three
                                                                                    timeout errors have occurred   A
                                                                                    write of a non-zero value to this bit
                                                                                    field decrements it by the value
                                                                                    provided. */

/* MCAN_PID Bits */
/* MCAN_PID[MINOR] Bits */
#define MCAN_PID_MINOR_OFS                       (0)                             /* !< MINOR Offset */
#define MCAN_PID_MINOR_MASK                      ((uint32_t)0x0000003FU)         /* !< Minor Revision of the MCAN
                                                                                    Subsystem */
/* MCAN_PID[MAJOR] Bits */
#define MCAN_PID_MAJOR_OFS                       (8)                             /* !< MAJOR Offset */
#define MCAN_PID_MAJOR_MASK                      ((uint32_t)0x00000700U)         /* !< Major Revision of the MCAN
                                                                                    Subsystem */
/* MCAN_PID[MODULE_ID] Bits */
#define MCAN_PID_MODULE_ID_OFS                   (16)                            /* !< MODULE_ID Offset */
#define MCAN_PID_MODULE_ID_MASK                  ((uint32_t)0x0FFF0000U)         /* !< Module Identification Number */
/* MCAN_PID[SCHEME] Bits */
#define MCAN_PID_SCHEME_OFS                      (30)                            /* !< SCHEME Offset */
#define MCAN_PID_SCHEME_MASK                     ((uint32_t)0xC0000000U)         /* !< PID Register Scheme */

/* MCAN_TI_WRAPPER_REGS_CTRL Bits */
/* MCAN_TI_WRAPPER_REGS_CTRL[DBGSUSP_FREE] Bits */
#define MCAN_TI_WRAPPER_REGS_CTRL_DBGSUSP_FREE_OFS (3)                             /* !< DBGSUSP_FREE Offset */
#define MCAN_TI_WRAPPER_REGS_CTRL_DBGSUSP_FREE_MASK ((uint32_t)0x00000008U)         /* !< Debug Suspend Free Bit. Enables
                                                                                    debug suspend.   0  Disable debug
                                                                                    suspend   1  Enable debug suspend */
/* MCAN_TI_WRAPPER_REGS_CTRL[WAKEUPREQEN] Bits */
#define MCAN_TI_WRAPPER_REGS_CTRL_WAKEUPREQEN_OFS (4)                             /* !< WAKEUPREQEN Offset */
#define MCAN_TI_WRAPPER_REGS_CTRL_WAKEUPREQEN_MASK ((uint32_t)0x00000010U)         /* !< Wakeup Request Enable. Enables the
                                                                                    MCANSS to wakeup on CAN RXD activity.
                                                                                    0  Disable wakeup request   1
                                                                                    Enables wakeup request */
/* MCAN_TI_WRAPPER_REGS_CTRL[AUTOWAKEUP] Bits */
#define MCAN_TI_WRAPPER_REGS_CTRL_AUTOWAKEUP_OFS (5)                             /* !< AUTOWAKEUP Offset */
#define MCAN_TI_WRAPPER_REGS_CTRL_AUTOWAKEUP_MASK ((uint32_t)0x00000020U)         /* !< Automatic Wakeup Enable. Enables
                                                                                    the MCANSS to automatically clear the
                                                                                    MCAN CCCR.INIT bit, fully waking the
                                                                                    MCAN up, on an enabled wakeup
                                                                                    request.   0  Disable the automatic
                                                                                    write to CCCR.INIT   1  Enable the
                                                                                    automatic write to CCCR.INIT */
/* MCAN_TI_WRAPPER_REGS_CTRL[EXT_TS_CNTR_EN] Bits */
#define MCAN_TI_WRAPPER_REGS_CTRL_EXT_TS_CNTR_EN_OFS (6)                             /* !< EXT_TS_CNTR_EN Offset */
#define MCAN_TI_WRAPPER_REGS_CTRL_EXT_TS_CNTR_EN_MASK ((uint32_t)0x00000040U)         /* !< External Timestamp Counter Enable.
                                                                                    0  External timestamp counter
                                                                                    disabled   1  External timestamp
                                                                                    counter enabled */

/* MCAN_TI_WRAPPER_PROCESSORS_REGS_STAT Bits */
/* MCAN_TI_WRAPPER_PROCESSORS_REGS_STAT[RESET] Bits */
#define MCAN_TI_WRAPPER_PROCESSORS_REGS_STAT_RESET_OFS (0)                             /* !< RESET Offset */
#define MCAN_TI_WRAPPER_PROCESSORS_REGS_STAT_RESET_MASK ((uint32_t)0x00000001U)         /* !< Soft Reset Status.   0  Not in
                                                                                    reset   1  Reset is in progress */
/* MCAN_TI_WRAPPER_PROCESSORS_REGS_STAT[MEM_INIT_DONE] Bits */
#define MCAN_TI_WRAPPER_PROCESSORS_REGS_STAT_MEM_INIT_DONE_OFS (1)                             /* !< MEM_INIT_DONE Offset */
#define MCAN_TI_WRAPPER_PROCESSORS_REGS_STAT_MEM_INIT_DONE_MASK ((uint32_t)0x00000002U)         /* !< Memory Initialization Done.   0
                                                                                    Message RAM initialization is in
                                                                                    progress   1  Message RAM is
                                                                                    initialized for use */
/* MCAN_TI_WRAPPER_PROCESSORS_REGS_STAT[ENABLE_FDOE] Bits */
#define MCAN_TI_WRAPPER_PROCESSORS_REGS_STAT_ENABLE_FDOE_OFS (2)                             /* !< ENABLE_FDOE Offset */
#define MCAN_TI_WRAPPER_PROCESSORS_REGS_STAT_ENABLE_FDOE_MASK ((uint32_t)0x00000004U)         /* !< Enable FD (Flexible Data-Rate)
                                                                                    Configuration Reflects the value of
                                                                                    mcanss_enable_fdoe configuration
                                                                                    port, -h = mcanss_enable_fdoe. */

