MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g3/thirdparty/mspm0g3/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_DBTP Bits */
/* MCAN_DBTP[DSJW] Bits */
#define MCAN_DBTP_DSJW_OFS                       (0)                             /* !< DSJW Offset */
#define MCAN_DBTP_DSJW_MASK                      ((uint32_t)0x0000000FU)         /* !< Data Resynchronization Jump Width.
                                                                                    Valid values are 0 to 15. The actual
                                                                                    interpretation by the hardware of
                                                                                    this value is such that one more than
                                                                                    the value programmed here is used.
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_DBTP[DTSEG2] Bits */
#define MCAN_DBTP_DTSEG2_OFS                     (4)                             /* !< DTSEG2 Offset */
#define MCAN_DBTP_DTSEG2_MASK                    ((uint32_t)0x000000F0U)         /* !< Data Time Segment After Sample
                                                                                    Point. Valid values are 0 to 15. The
                                                                                    actual interpretation by the hardware
                                                                                    of this value is such that one more
                                                                                    than the programmed value is used.
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_DBTP[DTSEG1] Bits */
#define MCAN_DBTP_DTSEG1_OFS                     (8)                             /* !< DTSEG1 Offset */
#define MCAN_DBTP_DTSEG1_MASK                    ((uint32_t)0x00001F00U)         /* !< Data Time Segment Before Sample
                                                                                    Point. Valid values are 0 to 31. The
                                                                                    actual interpretation by the hardware
                                                                                    of this value is such that one more
                                                                                    than the programmed value is used.
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_DBTP[DBRP] Bits */
#define MCAN_DBTP_DBRP_OFS                       (16)                            /* !< DBRP Offset */
#define MCAN_DBTP_DBRP_MASK                      ((uint32_t)0x001F0000U)         /* !< Data Bit Rate Prescaler. The value
                                                                                    by which the oscillator frequency is
                                                                                    divided for generating the bit time
                                                                                    quanta. The bit time is built up from
                                                                                    a multiple of this quanta. Valid
                                                                                    values for the Bit Rate Prescaler are
                                                                                    0 to 31. The actual interpretation by
                                                                                    the hardware of this value is such
                                                                                    that one more than the value
                                                                                    programmed here is used.   Qualified
                                                                                    Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_DBTP[TDC] Bits */
#define MCAN_DBTP_TDC_OFS                        (23)                            /* !< TDC Offset */
#define MCAN_DBTP_TDC_MASK                       ((uint32_t)0x00800000U)         /* !< Transmitter Delay Compensation   0
                                                                                    Transmitter Delay Compensation
                                                                                    disabled   1  Transmitter Delay
                                                                                    Compensation enabled */

/* MCAN_TEST Bits */
/* MCAN_TEST[LBCK] Bits */
#define MCAN_TEST_LBCK_OFS                       (4)                             /* !< LBCK Offset */
#define MCAN_TEST_LBCK_MASK                      ((uint32_t)0x00000010U)         /* !< Loop Back Mode. Qualified Write is
                                                                                    possible only with CCCR.CCE='1' and
                                                                                    CCCR.INIT='1'. */
#define MCAN_TEST_LBCK_DISABLE                   ((uint32_t)0x00000000U)         /* !< Reset value, Loop Back Mode is
                                                                                    disabled */
#define MCAN_TEST_LBCK_ENABLE                    ((uint32_t)0x00000010U)         /* !< Loop Back Mode is enabled */
/* MCAN_TEST[TX] Bits */
#define MCAN_TEST_TX_OFS                         (5)                             /* !< TX Offset */
#define MCAN_TEST_TX_MASK                        ((uint32_t)0x00000060U)         /* !< Control of Transmit Pin   00  CAN
                                                                                    TX pin controlled by the CAN Core,
                                                                                    up2025-09-29d at the end of the CAN bit
                                                                                    time   01  Sample Point can be
                                                                                    monitored at CAN TX pin   10
                                                                                    Dominant ('0') level at CAN TX pin
                                                                                    11  Recessive ('1') at CAN TX pin
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_TEST[RX] Bits */
#define MCAN_TEST_RX_OFS                         (7)                             /* !< RX Offset */
#define MCAN_TEST_RX_MASK                        ((uint32_t)0x00000080U)         /* !< Receive Pin. Monitors the actual
                                                                                    value of the CAN receive pin. */
#define MCAN_TEST_RX_DOMINANT                    ((uint32_t)0x00000000U)         /* !< The CAN bus is dominant (CAN RX pin
                                                                                    = '0') */
#define MCAN_TEST_RX_RECESSIVE                   ((uint32_t)0x00000080U)         /* !< The CAN bus is recessive (CAN RX
                                                                                    pin = '1') */

/* MCAN_RWD Bits */
/* MCAN_RWD[WDC] Bits */
#define MCAN_RWD_WDC_OFS                         (0)                             /* !< WDC Offset */
#define MCAN_RWD_WDC_MASK                        ((uint32_t)0x000000FFU)         /* !< Watchdog Configuration. Start value
                                                                                    of the Message RAM Watchdog Counter.
                                                                                    With the reset value of "00" the
                                                                                    counter is disabled.   Qualified
                                                                                    Write is possible only with
                                                                                    CCCR.CCE='1' and CCCR.INIT='1'. */
/* MCAN_RWD[WDV] Bits */
#define MCAN_RWD_WDV_OFS                         (8)                             /* !< WDV Offset */
#define MCAN_RWD_WDV_MASK                        ((uint32_t)0x0000FF00U)         /* !< Watchdog Value. Acutal Message RAM
                                                                                    Watchdog Counter Value.   The RAM
                                                                                    Watchdog monitors the READY output of
                                                                                    the Message RAM. A Message RAM access
                                                                                    via the MCAN's Generic Master
                                                                                    Interface starts the Message RAM
                                                                                    Watchdog Counter with the value
                                                                                    configured by the WDC field. The
                                                                                    counter is reloaded with WDC when the
                                                                                    Message RAM signals successful
                                                                                    completion by activating its READY
                                                                                    output. In case there is no response
                                                                                    from the Message RAM until the
                                                                                    counter has counted down to zero, the
                                                                                    counter stops and interrupt flag
                                                                                    MCAN_IR.WDI is set. The RAM Watchdog
                                                                                    Counter is clocked by the host
                                                                                    (system) clock. */

