MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g3/thirdparty/mspm0g3/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_TXBRP Bits */
/* MCAN_TXBRP[TRP0] Bits */
#define MCAN_TXBRP_TRP0_OFS                      (0)                             /* !< TRP0 Offset */
#define MCAN_TXBRP_TRP0_MASK                     ((uint32_t)0x00000001U)         /* !< Transmission Request Pending 0.
                                                                                    Each Tx Buffer has its own
                                                                                    Transmission Request Pending bit. The
                                                                                    bits are set via register TXBAR. The
                                                                                    bits are reset after a requested
                                                                                    transmission has completed or has
                                                                                    been cancelled via register TXBCR.
                                                                                    TXBRP bits are set only for those Tx
                                                                                    Buffers configured via TXBC. After a
                                                                                    TXBRP bit has been set, a Tx scan is
                                                                                    started to check for the pending Tx
                                                                                    request with the highest priority (Tx
                                                                                    Buffer with lowest Message ID).   A
                                                                                    cancellation request resets the
                                                                                    corresponding transmission request
                                                                                    pending bit of register TXBRP. In
                                                                                    case a transmission has already been
                                                                                    started when a cancellation is
                                                                                    requested, this is done at the end of
                                                                                    the transmission, regardless whether
                                                                                    the transmission was successful or
                                                                                    not. The cancellation request bits
                                                                                    are reset directly after the
                                                                                    corresponding TXBRP bit has been
                                                                                    reset.   After a cancellation has
                                                                                    been requested, a finished
                                                                                    cancellation is signalled via TXBCF -
                                                                                    after successful transmission
                                                                                    together with the corresponding TXBTO
                                                                                    bit - when the transmission has not
                                                                                    yet been started at the point of
                                                                                    cancellation - when the transmission
                                                                                    has been aborted due to lost
                                                                                    arbitration - when an error occurred
                                                                                    during frame transmission   In DAR
                                                                                    mode all transmissions are
                                                                                    automatically cancelled if they are
                                                                                    not successful. The corresponding
                                                                                    TXBCF bit is set for all unsuccessful
                                                                                    transmissions.   0  No transmission
                                                                                    request pending   1  Transmission
                                                                                    request pending   Note: TXBRP bits
                                                                                    which are set while a Tx scan is in
                                                                                    progress are not considered during
                                                                                    this particular Tx scan. In case a
                                                                                    cancellation is requested for such a
                                                                                    Tx Buffer, this Add Request is
                                                                                    cancelled immediately, the
                                                                                    corresponding TXBRP bit is reset. */
/* MCAN_TXBRP[TRP1] Bits */
#define MCAN_TXBRP_TRP1_OFS                      (1)                             /* !< TRP1 Offset */
#define MCAN_TXBRP_TRP1_MASK                     ((uint32_t)0x00000002U)         /* !< Transmission Request Pending 1. See
                                                                                    description for bit 0. */
/* MCAN_TXBRP[TRP2] Bits */
#define MCAN_TXBRP_TRP2_OFS                      (2)                             /* !< TRP2 Offset */
#define MCAN_TXBRP_TRP2_MASK                     ((uint32_t)0x00000004U)         /* !< Transmission Request Pending 2. See
                                                                                    description for bit 0. */
/* MCAN_TXBRP[TRP3] Bits */
#define MCAN_TXBRP_TRP3_OFS                      (3)                             /* !< TRP3 Offset */
#define MCAN_TXBRP_TRP3_MASK                     ((uint32_t)0x00000008U)         /* !< Transmission Request Pending 3. See
                                                                                    description for bit 0. */
/* MCAN_TXBRP[TRP4] Bits */
#define MCAN_TXBRP_TRP4_OFS                      (4)                             /* !< TRP4 Offset */
#define MCAN_TXBRP_TRP4_MASK                     ((uint32_t)0x00000010U)         /* !< Transmission Request Pending 4. See
                                                                                    description for bit 0. */
/* MCAN_TXBRP[TRP5] Bits */
#define MCAN_TXBRP_TRP5_OFS                      (5)                             /* !< TRP5 Offset */
#define MCAN_TXBRP_TRP5_MASK                     ((uint32_t)0x00000020U)         /* !< Transmission Request Pending 5. See
                                                                                    description for bit 0. */
/* MCAN_TXBRP[TRP6] Bits */
#define MCAN_TXBRP_TRP6_OFS                      (6)                             /* !< TRP6 Offset */
#define MCAN_TXBRP_TRP6_MASK                     ((uint32_t)0x00000040U)         /* !< Transmission Request Pending 6. See
                                                                                    description for bit 0. */
/* MCAN_TXBRP[TRP7] Bits */
#define MCAN_TXBRP_TRP7_OFS                      (7)                             /* !< TRP7 Offset */
#define MCAN_TXBRP_TRP7_MASK                     ((uint32_t)0x00000080U)         /* !< Transmission Request Pending 7. See
                                                                                    description for bit 0. */
/* MCAN_TXBRP[TRP8] Bits */
#define MCAN_TXBRP_TRP8_OFS                      (8)                             /* !< TRP8 Offset */
#define MCAN_TXBRP_TRP8_MASK                     ((uint32_t)0x00000100U)         /* !< Transmission Request Pending 8. See
                                                                                    description for bit 0. */
/* MCAN_TXBRP[TRP9] Bits */
#define MCAN_TXBRP_TRP9_OFS                      (9)                             /* !< TRP9 Offset */
#define MCAN_TXBRP_TRP9_MASK                     ((uint32_t)0x00000200U)         /* !< Transmission Request Pending 9. See
                                                                                    description for bit 0. */
/* MCAN_TXBRP[TRP10] Bits */
#define MCAN_TXBRP_TRP10_OFS                     (10)                            /* !< TRP10 Offset */
#define MCAN_TXBRP_TRP10_MASK                    ((uint32_t)0x00000400U)         /* !< Transmission Request Pending 10.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP11] Bits */
#define MCAN_TXBRP_TRP11_OFS                     (11)                            /* !< TRP11 Offset */
#define MCAN_TXBRP_TRP11_MASK                    ((uint32_t)0x00000800U)         /* !< Transmission Request Pending 11.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP12] Bits */
#define MCAN_TXBRP_TRP12_OFS                     (12)                            /* !< TRP12 Offset */
#define MCAN_TXBRP_TRP12_MASK                    ((uint32_t)0x00001000U)         /* !< Transmission Request Pending 12.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP13] Bits */
#define MCAN_TXBRP_TRP13_OFS                     (13)                            /* !< TRP13 Offset */
#define MCAN_TXBRP_TRP13_MASK                    ((uint32_t)0x00002000U)         /* !< Transmission Request Pending 13.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP14] Bits */
#define MCAN_TXBRP_TRP14_OFS                     (14)                            /* !< TRP14 Offset */
#define MCAN_TXBRP_TRP14_MASK                    ((uint32_t)0x00004000U)         /* !< Transmission Request Pending 14.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP15] Bits */
#define MCAN_TXBRP_TRP15_OFS                     (15)                            /* !< TRP15 Offset */
#define MCAN_TXBRP_TRP15_MASK                    ((uint32_t)0x00008000U)         /* !< Transmission Request Pending 15.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP16] Bits */
#define MCAN_TXBRP_TRP16_OFS                     (16)                            /* !< TRP16 Offset */
#define MCAN_TXBRP_TRP16_MASK                    ((uint32_t)0x00010000U)         /* !< Transmission Request Pending 16.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP17] Bits */
#define MCAN_TXBRP_TRP17_OFS                     (17)                            /* !< TRP17 Offset */
#define MCAN_TXBRP_TRP17_MASK                    ((uint32_t)0x00020000U)         /* !< Transmission Request Pending 17.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP18] Bits */
#define MCAN_TXBRP_TRP18_OFS                     (18)                            /* !< TRP18 Offset */
#define MCAN_TXBRP_TRP18_MASK                    ((uint32_t)0x00040000U)         /* !< Transmission Request Pending 18.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP19] Bits */
#define MCAN_TXBRP_TRP19_OFS                     (19)                            /* !< TRP19 Offset */
#define MCAN_TXBRP_TRP19_MASK                    ((uint32_t)0x00080000U)         /* !< Transmission Request Pending 19.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP20] Bits */
#define MCAN_TXBRP_TRP20_OFS                     (20)                            /* !< TRP20 Offset */
#define MCAN_TXBRP_TRP20_MASK                    ((uint32_t)0x00100000U)         /* !< Transmission Request Pending 20.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP21] Bits */
#define MCAN_TXBRP_TRP21_OFS                     (21)                            /* !< TRP21 Offset */
#define MCAN_TXBRP_TRP21_MASK                    ((uint32_t)0x00200000U)         /* !< Transmission Request Pending 21.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP22] Bits */
#define MCAN_TXBRP_TRP22_OFS                     (22)                            /* !< TRP22 Offset */
#define MCAN_TXBRP_TRP22_MASK                    ((uint32_t)0x00400000U)         /* !< Transmission Request Pending 22.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP23] Bits */
#define MCAN_TXBRP_TRP23_OFS                     (23)                            /* !< TRP23 Offset */
#define MCAN_TXBRP_TRP23_MASK                    ((uint32_t)0x00800000U)         /* !< Transmission Request Pending 23.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP24] Bits */
#define MCAN_TXBRP_TRP24_OFS                     (24)                            /* !< TRP24 Offset */
#define MCAN_TXBRP_TRP24_MASK                    ((uint32_t)0x01000000U)         /* !< Transmission Request Pending 24.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP25] Bits */
#define MCAN_TXBRP_TRP25_OFS                     (25)                            /* !< TRP25 Offset */
#define MCAN_TXBRP_TRP25_MASK                    ((uint32_t)0x02000000U)         /* !< Transmission Request Pending 25.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP26] Bits */
#define MCAN_TXBRP_TRP26_OFS                     (26)                            /* !< TRP26 Offset */
#define MCAN_TXBRP_TRP26_MASK                    ((uint32_t)0x04000000U)         /* !< Transmission Request Pending 26.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP27] Bits */
#define MCAN_TXBRP_TRP27_OFS                     (27)                            /* !< TRP27 Offset */
#define MCAN_TXBRP_TRP27_MASK                    ((uint32_t)0x08000000U)         /* !< Transmission Request Pending 27.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP28] Bits */
#define MCAN_TXBRP_TRP28_OFS                     (28)                            /* !< TRP28 Offset */
#define MCAN_TXBRP_TRP28_MASK                    ((uint32_t)0x10000000U)         /* !< Transmission Request Pending 28.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP29] Bits */
#define MCAN_TXBRP_TRP29_OFS                     (29)                            /* !< TRP29 Offset */
#define MCAN_TXBRP_TRP29_MASK                    ((uint32_t)0x20000000U)         /* !< Transmission Request Pending 29.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP30] Bits */
#define MCAN_TXBRP_TRP30_OFS                     (30)                            /* !< TRP30 Offset */
#define MCAN_TXBRP_TRP30_MASK                    ((uint32_t)0x40000000U)         /* !< Transmission Request Pending 30.
                                                                                    See description for bit 0. */
/* MCAN_TXBRP[TRP31] Bits */
#define MCAN_TXBRP_TRP31_OFS                     (31)                            /* !< TRP31 Offset */
#define MCAN_TXBRP_TRP31_MASK                    ((uint32_t)0x80000000U)         /* !< Transmission Request Pending 31.
                                                                                    See description for bit 0. */

