MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g3/thirdparty/mspm0g3/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_TXBAR Bits */
/* MCAN_TXBAR[AR0] Bits */
#define MCAN_TXBAR_AR0_OFS                       (0)                             /* !< AR0 Offset */
#define MCAN_TXBAR_AR0_MASK                      ((uint32_t)0x00000001U)         /* !< Add Request 0.   Each Tx Buffer has
                                                                                    its own Add Request bit. Writing a
                                                                                    '1' will set the corresponding Add
                                                                                    Request bit; writing a '0' has no
                                                                                    impact. This enables the Host to set
                                                                                    transmission requests for multiple Tx
                                                                                    Buffers with one write to TXBAR.
                                                                                    TXBAR bits are set only for those Tx
                                                                                    Buffers configured via TXBC. When no
                                                                                    Tx scan is running, the bits are
                                                                                    reset immediately, else the bits
                                                                                    remain set until the Tx scan process
                                                                                    has completed.   0  No transmission
                                                                                    request added   1  Transmission
                                                                                    requested added   Note: If an add
                                                                                    request is applied for a Tx Buffer
                                                                                    with pending transmission request
                                                                                    (corresponding TXBRP bit already
                                                                                    set), this add request is ignored.
                                                                                    Qualified Write is possible only with
                                                                                    CCCR.CCE='0' */
/* MCAN_TXBAR[AR1] Bits */
#define MCAN_TXBAR_AR1_OFS                       (1)                             /* !< AR1 Offset */
#define MCAN_TXBAR_AR1_MASK                      ((uint32_t)0x00000002U)         /* !< Add Request 1. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR2] Bits */
#define MCAN_TXBAR_AR2_OFS                       (2)                             /* !< AR2 Offset */
#define MCAN_TXBAR_AR2_MASK                      ((uint32_t)0x00000004U)         /* !< Add Request 2. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR3] Bits */
#define MCAN_TXBAR_AR3_OFS                       (3)                             /* !< AR3 Offset */
#define MCAN_TXBAR_AR3_MASK                      ((uint32_t)0x00000008U)         /* !< Add Request 3. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR4] Bits */
#define MCAN_TXBAR_AR4_OFS                       (4)                             /* !< AR4 Offset */
#define MCAN_TXBAR_AR4_MASK                      ((uint32_t)0x00000010U)         /* !< Add Request 4. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR5] Bits */
#define MCAN_TXBAR_AR5_OFS                       (5)                             /* !< AR5 Offset */
#define MCAN_TXBAR_AR5_MASK                      ((uint32_t)0x00000020U)         /* !< Add Request 5. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR6] Bits */
#define MCAN_TXBAR_AR6_OFS                       (6)                             /* !< AR6 Offset */
#define MCAN_TXBAR_AR6_MASK                      ((uint32_t)0x00000040U)         /* !< Add Request 6. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR7] Bits */
#define MCAN_TXBAR_AR7_OFS                       (7)                             /* !< AR7 Offset */
#define MCAN_TXBAR_AR7_MASK                      ((uint32_t)0x00000080U)         /* !< Add Request 7. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR8] Bits */
#define MCAN_TXBAR_AR8_OFS                       (8)                             /* !< AR8 Offset */
#define MCAN_TXBAR_AR8_MASK                      ((uint32_t)0x00000100U)         /* !< Add Request 8. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR9] Bits */
#define MCAN_TXBAR_AR9_OFS                       (9)                             /* !< AR9 Offset */
#define MCAN_TXBAR_AR9_MASK                      ((uint32_t)0x00000200U)         /* !< Add Request 9. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR10] Bits */
#define MCAN_TXBAR_AR10_OFS                      (10)                            /* !< AR10 Offset */
#define MCAN_TXBAR_AR10_MASK                     ((uint32_t)0x00000400U)         /* !< Add Request 10. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR11] Bits */
#define MCAN_TXBAR_AR11_OFS                      (11)                            /* !< AR11 Offset */
#define MCAN_TXBAR_AR11_MASK                     ((uint32_t)0x00000800U)         /* !< Add Request 11. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR12] Bits */
#define MCAN_TXBAR_AR12_OFS                      (12)                            /* !< AR12 Offset */
#define MCAN_TXBAR_AR12_MASK                     ((uint32_t)0x00001000U)         /* !< Add Request 12. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR13] Bits */
#define MCAN_TXBAR_AR13_OFS                      (13)                            /* !< AR13 Offset */
#define MCAN_TXBAR_AR13_MASK                     ((uint32_t)0x00002000U)         /* !< Add Request 13. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR14] Bits */
#define MCAN_TXBAR_AR14_OFS                      (14)                            /* !< AR14 Offset */
#define MCAN_TXBAR_AR14_MASK                     ((uint32_t)0x00004000U)         /* !< Add Request 14. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR15] Bits */
#define MCAN_TXBAR_AR15_OFS                      (15)                            /* !< AR15 Offset */
#define MCAN_TXBAR_AR15_MASK                     ((uint32_t)0x00008000U)         /* !< Add Request 15. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR16] Bits */
#define MCAN_TXBAR_AR16_OFS                      (16)                            /* !< AR16 Offset */
#define MCAN_TXBAR_AR16_MASK                     ((uint32_t)0x00010000U)         /* !< Add Request 16. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR17] Bits */
#define MCAN_TXBAR_AR17_OFS                      (17)                            /* !< AR17 Offset */
#define MCAN_TXBAR_AR17_MASK                     ((uint32_t)0x00020000U)         /* !< Add Request 17. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR18] Bits */
#define MCAN_TXBAR_AR18_OFS                      (18)                            /* !< AR18 Offset */
#define MCAN_TXBAR_AR18_MASK                     ((uint32_t)0x00040000U)         /* !< Add Request 18. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR19] Bits */
#define MCAN_TXBAR_AR19_OFS                      (19)                            /* !< AR19 Offset */
#define MCAN_TXBAR_AR19_MASK                     ((uint32_t)0x00080000U)         /* !< Add Request 19. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR20] Bits */
#define MCAN_TXBAR_AR20_OFS                      (20)                            /* !< AR20 Offset */
#define MCAN_TXBAR_AR20_MASK                     ((uint32_t)0x00100000U)         /* !< Add Request 20. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR21] Bits */
#define MCAN_TXBAR_AR21_OFS                      (21)                            /* !< AR21 Offset */
#define MCAN_TXBAR_AR21_MASK                     ((uint32_t)0x00200000U)         /* !< Add Request 21. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR22] Bits */
#define MCAN_TXBAR_AR22_OFS                      (22)                            /* !< AR22 Offset */
#define MCAN_TXBAR_AR22_MASK                     ((uint32_t)0x00400000U)         /* !< Add Request 22. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR23] Bits */
#define MCAN_TXBAR_AR23_OFS                      (23)                            /* !< AR23 Offset */
#define MCAN_TXBAR_AR23_MASK                     ((uint32_t)0x00800000U)         /* !< Add Request 23. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR24] Bits */
#define MCAN_TXBAR_AR24_OFS                      (24)                            /* !< AR24 Offset */
#define MCAN_TXBAR_AR24_MASK                     ((uint32_t)0x01000000U)         /* !< Add Request 24. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR25] Bits */
#define MCAN_TXBAR_AR25_OFS                      (25)                            /* !< AR25 Offset */
#define MCAN_TXBAR_AR25_MASK                     ((uint32_t)0x02000000U)         /* !< Add Request 25. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR26] Bits */
#define MCAN_TXBAR_AR26_OFS                      (26)                            /* !< AR26 Offset */
#define MCAN_TXBAR_AR26_MASK                     ((uint32_t)0x04000000U)         /* !< Add Request 26. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR27] Bits */
#define MCAN_TXBAR_AR27_OFS                      (27)                            /* !< AR27 Offset */
#define MCAN_TXBAR_AR27_MASK                     ((uint32_t)0x08000000U)         /* !< Add Request 27. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR28] Bits */
#define MCAN_TXBAR_AR28_OFS                      (28)                            /* !< AR28 Offset */
#define MCAN_TXBAR_AR28_MASK                     ((uint32_t)0x10000000U)         /* !< Add Request 28. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR29] Bits */
#define MCAN_TXBAR_AR29_OFS                      (29)                            /* !< AR29 Offset */
#define MCAN_TXBAR_AR29_MASK                     ((uint32_t)0x20000000U)         /* !< Add Request 29. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR30] Bits */
#define MCAN_TXBAR_AR30_OFS                      (30)                            /* !< AR30 Offset */
#define MCAN_TXBAR_AR30_MASK                     ((uint32_t)0x40000000U)         /* !< Add Request 30. See description for
                                                                                    bit 0. */
/* MCAN_TXBAR[AR31] Bits */
#define MCAN_TXBAR_AR31_OFS                      (31)                            /* !< AR31 Offset */
#define MCAN_TXBAR_AR31_MASK                     ((uint32_t)0x80000000U)         /* !< Add Request 31. See description for
                                                                                    bit 0. */

