MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0g3/thirdparty/mspm0g3/ti/devices/msp/peripherals/hw_mcan.h
/* MCAN_TXBCIE Bits */
/* MCAN_TXBCIE[CFIE0] Bits */
#define MCAN_TXBCIE_CFIE0_OFS                    (0)                             /* !< CFIE0 Offset */
#define MCAN_TXBCIE_CFIE0_MASK                   ((uint32_t)0x00000001U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 0. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE1] Bits */
#define MCAN_TXBCIE_CFIE1_OFS                    (1)                             /* !< CFIE1 Offset */
#define MCAN_TXBCIE_CFIE1_MASK                   ((uint32_t)0x00000002U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 1. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE2] Bits */
#define MCAN_TXBCIE_CFIE2_OFS                    (2)                             /* !< CFIE2 Offset */
#define MCAN_TXBCIE_CFIE2_MASK                   ((uint32_t)0x00000004U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 2. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE3] Bits */
#define MCAN_TXBCIE_CFIE3_OFS                    (3)                             /* !< CFIE3 Offset */
#define MCAN_TXBCIE_CFIE3_MASK                   ((uint32_t)0x00000008U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 3. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE4] Bits */
#define MCAN_TXBCIE_CFIE4_OFS                    (4)                             /* !< CFIE4 Offset */
#define MCAN_TXBCIE_CFIE4_MASK                   ((uint32_t)0x00000010U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 4. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE5] Bits */
#define MCAN_TXBCIE_CFIE5_OFS                    (5)                             /* !< CFIE5 Offset */
#define MCAN_TXBCIE_CFIE5_MASK                   ((uint32_t)0x00000020U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 5. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE6] Bits */
#define MCAN_TXBCIE_CFIE6_OFS                    (6)                             /* !< CFIE6 Offset */
#define MCAN_TXBCIE_CFIE6_MASK                   ((uint32_t)0x00000040U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 6. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE7] Bits */
#define MCAN_TXBCIE_CFIE7_OFS                    (7)                             /* !< CFIE7 Offset */
#define MCAN_TXBCIE_CFIE7_MASK                   ((uint32_t)0x00000080U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 7. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE8] Bits */
#define MCAN_TXBCIE_CFIE8_OFS                    (8)                             /* !< CFIE8 Offset */
#define MCAN_TXBCIE_CFIE8_MASK                   ((uint32_t)0x00000100U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 8. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE9] Bits */
#define MCAN_TXBCIE_CFIE9_OFS                    (9)                             /* !< CFIE9 Offset */
#define MCAN_TXBCIE_CFIE9_MASK                   ((uint32_t)0x00000200U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 9. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE10] Bits */
#define MCAN_TXBCIE_CFIE10_OFS                   (10)                            /* !< CFIE10 Offset */
#define MCAN_TXBCIE_CFIE10_MASK                  ((uint32_t)0x00000400U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 10. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE11] Bits */
#define MCAN_TXBCIE_CFIE11_OFS                   (11)                            /* !< CFIE11 Offset */
#define MCAN_TXBCIE_CFIE11_MASK                  ((uint32_t)0x00000800U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 11. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE12] Bits */
#define MCAN_TXBCIE_CFIE12_OFS                   (12)                            /* !< CFIE12 Offset */
#define MCAN_TXBCIE_CFIE12_MASK                  ((uint32_t)0x00001000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 12. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE13] Bits */
#define MCAN_TXBCIE_CFIE13_OFS                   (13)                            /* !< CFIE13 Offset */
#define MCAN_TXBCIE_CFIE13_MASK                  ((uint32_t)0x00002000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 13. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE14] Bits */
#define MCAN_TXBCIE_CFIE14_OFS                   (14)                            /* !< CFIE14 Offset */
#define MCAN_TXBCIE_CFIE14_MASK                  ((uint32_t)0x00004000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 14. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE15] Bits */
#define MCAN_TXBCIE_CFIE15_OFS                   (15)                            /* !< CFIE15 Offset */
#define MCAN_TXBCIE_CFIE15_MASK                  ((uint32_t)0x00008000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 15. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE16] Bits */
#define MCAN_TXBCIE_CFIE16_OFS                   (16)                            /* !< CFIE16 Offset */
#define MCAN_TXBCIE_CFIE16_MASK                  ((uint32_t)0x00010000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 16. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE17] Bits */
#define MCAN_TXBCIE_CFIE17_OFS                   (17)                            /* !< CFIE17 Offset */
#define MCAN_TXBCIE_CFIE17_MASK                  ((uint32_t)0x00020000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 17. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE18] Bits */
#define MCAN_TXBCIE_CFIE18_OFS                   (18)                            /* !< CFIE18 Offset */
#define MCAN_TXBCIE_CFIE18_MASK                  ((uint32_t)0x00040000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 18. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE19] Bits */
#define MCAN_TXBCIE_CFIE19_OFS                   (19)                            /* !< CFIE19 Offset */
#define MCAN_TXBCIE_CFIE19_MASK                  ((uint32_t)0x00080000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 19. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE20] Bits */
#define MCAN_TXBCIE_CFIE20_OFS                   (20)                            /* !< CFIE20 Offset */
#define MCAN_TXBCIE_CFIE20_MASK                  ((uint32_t)0x00100000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 20. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE21] Bits */
#define MCAN_TXBCIE_CFIE21_OFS                   (21)                            /* !< CFIE21 Offset */
#define MCAN_TXBCIE_CFIE21_MASK                  ((uint32_t)0x00200000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 21. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE22] Bits */
#define MCAN_TXBCIE_CFIE22_OFS                   (22)                            /* !< CFIE22 Offset */
#define MCAN_TXBCIE_CFIE22_MASK                  ((uint32_t)0x00400000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 22. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE23] Bits */
#define MCAN_TXBCIE_CFIE23_OFS                   (23)                            /* !< CFIE23 Offset */
#define MCAN_TXBCIE_CFIE23_MASK                  ((uint32_t)0x00800000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 23. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE24] Bits */
#define MCAN_TXBCIE_CFIE24_OFS                   (24)                            /* !< CFIE24 Offset */
#define MCAN_TXBCIE_CFIE24_MASK                  ((uint32_t)0x01000000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 24. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
                                                                                    finished interrupt disabled   1
                                                                                    Cancellation finished interrupt
                                                                                    enabled */
/* MCAN_TXBCIE[CFIE25] Bits */
#define MCAN_TXBCIE_CFIE25_OFS                   (25)                            /* !< CFIE25 Offset */
#define MCAN_TXBCIE_CFIE25_MASK                  ((uint32_t)0x02000000U)         /* !< Cancellation Finished Interrupt
                                                                                    Enable 25. Each Tx Buffer has its own
                                                                                    Cancellation Finished Interrupt
                                                                                    Enable bit.   0  Cancellation
